In [2]:
from sqlalchemy import create_engine
import pymysql
import pandas as pd 
engine = create_engine('mysql+pymysql://root:12345678@localhost:3306/euro2012', echo=False)
table_info = pd.read_sql('show tables', engine)
table_info

  Tables_in_euro2012
0              eteam
1               game
2               goal

1. Show the matchid and player name for all goals scored by Germany

In [4]:
df_q1 = pd.read_sql("select g.matchid, g.player from goal g inner join eteam et on g.teamid = et.id where et.teamname = 'Germany'", engine)
df_q1

   matchid          player
0     1008     Mario Gómez
1     1010     Mario Gómez
2     1010     Mario Gómez
3     1012  Lukas Podolski
4     1012     Lars Bender
5     1026    Philipp Lahm
6     1026    Sami Khedira
7     1026  Miroslav Klose
8     1026      Marco Reus
9     1030      Mesut Özil

2. Show id, stadium, teamname1, teamname2 for just game 1012

In [6]:
df_q2 = pd.read_sql("select g.id, g.stadium, et1.teamname teamname1, et2.teamname teamname2 from game g inner join eteam et1 on g.team1 = et1.id inner join eteam et2 on g.team2 = et2.id where g.id = 1012", engine)
df_q2

     id     stadium teamname1 teamname2
0  1012  Arena Lviv   Denmark   Germany

3. Show the player, teamid, stadium and mdate for every German goal.

In [8]:
df_q3 = pd.read_sql('select go.player, go.teamid, ga.stadium, ga.mdate from goal go inner join eteam et on go.teamid = et.id inner join game ga on go.matchid = ga.id  where teamname = "Germany"', engine)
df_q3

           player teamid                   stadium         mdate
0     Mario Gómez    GER                Arena Lviv   9 June 2012
1     Mario Gómez    GER          Metalist Stadium  13 June 2012
2     Mario Gómez    GER          Metalist Stadium  13 June 2012
3  Lukas Podolski    GER                Arena Lviv  17 June 2012
4     Lars Bender    GER                Arena Lviv  17 June 2012
5    Philipp Lahm    GER          PGE Arena Gdansk  22 June 2012
6    Sami Khedira    GER          PGE Arena Gdansk  22 June 2012
7  Miroslav Klose    GER          PGE Arena Gdansk  22 June 2012
8      Marco Reus    GER          PGE Arena Gdansk  22 June 2012
9      Mesut Özil    GER  National Stadium, Warsaw  28 June 2012

4. Show the team1, team2 and player for every goal scored by a player called Mario

In [10]:
df_q4 = pd.read_sql("select ga.team1, ga.team2, go.player from game ga inner join goal go on ga.id = go.matchid where go.player like 'Mario%%'", engine)
df_q4

  team1 team2           player
0   GER   POR      Mario Gómez
1   NED   GER      Mario Gómez
2   NED   GER      Mario Gómez
3   IRL   CRO  Mario Mandžukic
4   IRL   CRO  Mario Mandžukic
5   ITA   CRO  Mario Mandžukic
6   ITA   IRL  Mario Balotelli
7   GER   ITA  Mario Balotelli
8   GER   ITA  Mario Balotelli

5. Show player, teamid, coach, gtime for all goals scored in the first 10 minutes gtime<=10

In [12]:
df_q5 = pd.read_sql("select go.player, go.teamid, et.coach, go.gtime from goal go inner join eteam et on go.teamid = et.id where go.gtime <=10", engine)
df_q5

            player teamid               coach  gtime
0     Petr Jirácek    CZE        Michal Bílek      3
1     Václav Pilar    CZE        Michal Bílek      6
2  Mario Mandžukic    CRO        Slaven Bilic      3
3  Fernando Torres    ESP  Vicente del Bosque      4

6. List the dates of the matches and the name of the teams in which 'Fernando Santos' was the coach of one of two teams

In [14]:
df_q6 = pd.read_sql("select  ga.mdate, et1.teamname, et2.teamname from game ga inner join eteam et1 on ga.team1 = et1.id inner join eteam et2 on ga.team2 = et2.id where et1.coach = 'Fernando Santos' or et2.coach = 'Fernando Santos'", engine)
df_q6

          mdate teamname        teamname
0  16 June 2012   Greece          Russia
1  12 June 2012   Greece  Czech Republic
2   8 June 2012   Poland          Greece
3  22 June 2012  Germany          Greece

7. List the player for every goal scored in a game where the stadium was 'National Stadium, Warsaw'

In [16]:
df_q7 = pd.read_sql("select go.player from goal go inner join game ga on go.matchid = ga.id where ga.stadium = 'National Stadium, Warsaw'", engine)
df_q7

                 player
0    Robert Lewandowski
1  Dimitris Salpingidis
2          Alan Dzagoev
3  Jakub Blaszczykowski
4    Giorgos Karagounis
5     Cristiano Ronaldo
6       Mario Balotelli
7       Mario Balotelli
8            Mesut Özil

8. In the Germany-Greece quarterfinal, show the name of all players who scored a goal against Germany

In [18]:
df_q8 = pd.read_sql("select go.player from game ga inner join goal go on ga.id = go.matchid where ((ga.team1 = 'GER' and ga.team2 = 'GRE') or (ga.team1 = 'GRE' and ga.team2 = 'GER')) and go.teamid = 'GRE'", engine)
df_q8

                 player
0      Georgios Samaras
1  Dimitris Salpingidis

9. Show teamname and the total number of goals scored

In [20]:
df_q9 = pd.read_sql("select t2.teamname, t1.Count from (select teamid, count(*) Count from goal group by teamid) t1 inner join eteam t2 on t1.teamid = t2.id order by teamname", engine)
df_q9

               teamname  Count
0               Croatia      4
1        Czech Republic      4
2               Denmark      4
3               England      5
4                France      3
5               Germany     10
6                Greece      5
7                 Italy      6
8           Netherlands      2
9                Poland      2
10             Portugal      6
11  Republic of Ireland      1
12               Russia      5
13                Spain     12
14               Sweden      5
15              Ukraine      2

10. Show the stadium and the number of goals scored in each stadium.

In [22]:
df_q10 = pd.read_sql("select ga.stadium, count(*) Count from game ga inner join goal go on ga.id = go.matchid group by ga.stadium", engine)
df_q10

                               stadium  Count
0             National Stadium, Warsaw      9
1            Stadion Miejski (Wroclaw)      9
2                     Metalist Stadium      7
3                           Arena Lviv      9
4                     PGE Arena Gdansk     13
5             Stadion Miejski (Poznan)      8
6                        Donbass Arena      7
7  Olimpiyskiy National Sports Complex     14

11. For every match involving 'POL', show the matchid, date and the number of goals scored.

In [25]:
df_q11 = pd.read_sql("select ga.id, ga.mdate, count(*) Goals from game ga inner join goal go on ga.id = go.matchid where ga.team1 = 'POL' or ga.team2 = 'POL' group by go.matchid", engine)
df_q11

     id         mdate  Goals
0  1001   8 June 2012      2
1  1004  12 June 2012      2
2  1005  16 June 2012      1

12. For every match where 'GER' scored, show matchid, match date and the number of goals scored by 'GER'

In [28]:
df_q12 = pd.read_sql("select go.matchid, ga.mdate, count(*) Goal from goal go inner join game ga on go.matchid = ga.id where go.teamid = 'GER' group by go.matchid", engine)
df_q12

   matchid         mdate  Goal
0     1008   9 June 2012     1
1     1010  13 June 2012     2
2     1012  17 June 2012     2
3     1026  22 June 2012     4
4     1030  28 June 2012     1

13. List every match with the goals scored by each team

In [30]:
df_q13 = pd.read_sql("select go.matchid, ga.team1, sum(case when go.teamid = ga.team1 then 1 else 0 end) goal1, ga.team2, sum(case when go.teamid = ga.team2 then 1 else 0 end) goal2 from goal go inner join game ga on go.matchid = ga.id group by go.matchid, go.teamid", engine)
df_q13

    matchid team1  goal1 team2  goal2
0      1001   POL    1.0   GRE    0.0
1      1001   POL    0.0   GRE    1.0
2      1002   RUS    4.0   CZE    0.0
3      1002   RUS    0.0   CZE    1.0
4      1003   GRE    0.0   CZE    2.0
5      1003   GRE    1.0   CZE    0.0
6      1004   POL    0.0   RUS    1.0
7      1004   POL    1.0   RUS    0.0
8      1005   CZE    1.0   POL    0.0
9      1006   GRE    1.0   RUS    0.0
10     1007   NED    0.0   DEN    1.0
11     1008   GER    1.0   POR    0.0
12     1009   DEN    0.0   POR    3.0
13     1009   DEN    2.0   POR    0.0
14     1010   NED    0.0   GER    2.0
15     1010   NED    1.0   GER    0.0
16     1011   POR    0.0   NED    1.0
17     1011   POR    2.0   NED    0.0
18     1012   DEN    0.0   GER    2.0
19     1012   DEN    1.0   GER    0.0
20     1013   ESP    0.0   ITA    1.0
21     1013   ESP    1.0   ITA    0.0
22     1014   IRL    0.0   CRO    3.0
23     1014   IRL    1.0   CRO    0.0
24     1015   ITA    1.0   CRO    0.0
25     1015   ITA    0.0   CRO    1.0
26     1016   ESP    4.0   IRL    0.0
27     1017   CRO    0.0   ESP    1.0
28     1018   ITA    2.0   IRL    0.0
29     1019   FRA    0.0   ENG    1.0
30     1019   FRA    1.0   ENG    0.0
31     1020   UKR    0.0   SWE    1.0
32     1020   UKR    2.0   SWE    0.0
33     1021   UKR    0.0   FRA    2.0
34     1022   SWE    0.0   ENG    3.0
35     1022   SWE    2.0   ENG    0.0
36     1023   ENG    1.0   UKR    0.0
37     1024   SWE    2.0   FRA    0.0
38     1025   CZE    0.0   POR    1.0
39     1026   GER    4.0   GRE    0.0
40     1026   GER    0.0   GRE    2.0
41     1027   ESP    2.0   FRA    0.0
42     1030   GER    0.0   ITA    2.0
43     1030   GER    1.0   ITA    0.0
44     1031   ESP    4.0  ITA     0.0